# BuiltInFailures.HvacFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..HvacFailures Class
BuiltInFailures Class Members See Also
---
Failures related to HVAC in MEP.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class HvacFailures
```

Visual Basic
---
```text
Public NotInheritable Class HvacFailures
```

Visual C++
---
```text
public ref class HvacFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..HvacFailures
# See Also
BuiltInFailures..::..HvacFailures Members
Autodesk.Revit.DB Namespace